Tekla.Structures.Model.ModelObjectSolidExtension
The Tekla.Structures.Model.ModelObjectSolidExtension class provides a means obtaining Tekla.Structures.Model.Solid data from
a Tekla.Structures.Model.ModelObject.

Tekla.Structures.Model.ModelObjectSolidExtension.PartSolidCreationType
Gets or sets the solid creation type.

Tekla.Structures.Model.ModelObjectSolidExtension.GetObjectSolid(Tekla.Structures.Model.ModelObject)
Gets the solid for the given model object.
modelObject: The model object.
Returns: The solid.